Revit 2025 API
WallpaintApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "WallpaintApplication" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WallpaintApplicationType
Public Enumeration WallpaintApplicationType
public enum class WallpaintApplicationType
type WallpaintApplicationType
Members
Member name | Value | Description
Roller | 0
Brush | 1
Spray | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace